{"31":"1","32":"2","41":"A","50":"P","14935":"Top","1245353":"If you’re working on a project that will help create a better DWeb, ","4630008":"Logos","6846475":"No results found.","15309273":"Explore","28278262":".gradient:green-purple","38622077":"Terms of Use","51510194":"General Counsel, Brex","66203834":"II. Prohibited Conduct","77995108":", including information you provide if you transact business with us or receive funding from us, such as contracted-for services, records of personal property, and financial information such as your payment method (e.g., valid credit card number, bank account information, or other financial information);","78443255":".bg-electric-violet","-377645da":"About FFDW","645f0031":"About us","506e07af":"Promise > Vision","7455795c":"Board & Vision","-7bc27f6b":"Careers","-6d7bfef4":"Explore Web3","72ec8bae":"Learn about Web3","54cb6612":"Project Partners","35de8fd8":"Educational Resources","1fa3c2":"Blog","13ede05":"Resources","-6388b573":"Contribute","4422b111":"Get Involved","39869d1f":"Apply for Awards","4bd3410d":"Collaborators","4b61157b":"DWeb Impact Resources","69401a07":"Rebuilding","-671413e2":"the internet.","6059dcda":"For good.","-52aefc2f":"Learn more","3c2aad72":"FFDW exists to advance humankind by furthering the future of the web through education, research, and development.","5a746465":"Centralized","-51641a21":"We exist to build a better web","200d":"‍","7bc89277":"Filecoin Foundation for the Decentralized Web is a 501(c)(3) nonprofit organization committed to preserving humanity’s most important information by fostering the development of open-source software and open protocols.","5aeeb544":"Decentralized","26ac69cc":"Explore the DWeb","6b11aa6d":"Welcome to the next generation of the web","6fa3cd48":"We support programs that educate the public about how the Internet works and what a decentralized future means for business, governments and consumers alike. Learn more about the benefits of decentralization and the promise of Web3, through interactive tutorials, white papers, video resources and more.","661d8788":"Education","-22332c8a":"We support programs that educate the public about how the internet works and what a Web3 future means for business, governments, and consumers alike.","-110fda45":"Research","6ebbd4e":"We explore the ways to improve and expand decentralized web data and retrieval and storage with outputs that are freely and publicly accessible.","5603451b":"Development","1e0c2737":"We drive the creation and development of technologies that will enable decentralized file storage of humanity’s most important information.","44d85add":"Funding","7e2aa0cf":"We are dedicated to funding the development of open-source tools that will be the backbone of tomorrow’s decentralized web.","-475b7d60":"Frequently Asked Questions","-4294797c":"What is your non-profit status?","715639b1":"FFDW has applied for 501(c)(3) tax exempt, private opening foundation status. Maintaining adherence to mission is important from source (FFDW) to destination (end recipient), no matter the type of funding instrument (contract, award, grant, donation) used to provide resources to end recipients.","5bcd84b7":"What’s the relationship between the Filecoin Foundation for the Decentralized Web and the Filecoin Foundation?","-16f565b4":"The creators of Filecoin envisioned an independent foundation that would serve as the long-term governance body for the Filecoin ecosystem. Its original mandate was to “grow an open ecosystem for decentralized storage” and to “give developers an open and sustainable platform to build, enhance and monetize those services.","-1a0136d4":"”Filecoin Foundation (FF) is an independent organization that facilitates governance of the Filecoin network, funds critical development projects, supports the growth of Filecoin ecosystem, and advocates for Filecoin and the decentralized web. FF does this by coordinating and supporting the creation and improvement of open-source software and open protocols for decentralized data storage and retrieval networks.","-17b5fda5":"Filecoin Foundation for the Decentralized Web (FFDW) focuses on charitable activities related to preserving important datasets, such as building and supporting the decentralized web community, funding research and development, and educating the public about the decentralized web.","1ce71aec":"EXPLORE THE DWEB","75a5bdd6":"Awards","-62adc38e":"We exist to ensure the power of humanity’s most important information is never compromised, abused, or ruled by any single entity.","28e303f4":"we want to hear from you","2e":".","-613b9858":"Introducing the Starling Lab","-816e2eb":"The Starling Lab Award Spotlight","-59241023":"Filecoin Foundation for the Decentralized Web announced a multi-year commitment to ","4545b624":"The Starling Lab","-6c749f86":", a research center developing a comprehensive set of tools and principles that empower organizations to securely capture, store, and verify human history.","-421fa511":"Join the conversation and build a better Internet.","5a0ea5a1":"Thank you! Your submission has been received!","-7c112e99":"Oops! Something went wrong while submitting the form.","51c98c95":"Latest News From FFDW","7baa38d6":"Updates from our organization and across the Web3 universe.","2c":",","7c":"|","3d503d2b":"No items found.","472f65a6":"view all","7f2746de":"Contact Us","-3fbde6f6":"Privacy Policy","2c9a4253":"Twitter","281bc303":"Youtube","4b0ff51e":"Linkedin","3e2edd8":"Close","-11d4bbff":"Protected Page","4c641ebb":"Password","-f5c4b5f":"Incorrect password. Please try again.","2268ff":"Home","7fc2":" > ","-26269094":"404 Page Not Found","57bd0b6f":"Whoops, this page doesn’t exist! ","-3462bf75":"Ada Lovelace","-3e2f2b1a":"Nurturing the growth of the decentralized web","715e87c6":"Building and supporting the decentralized community","-208e8061":"Filecoin Foundation for the Decentralized Web (FFDW) is a 501(c)(3) non-profit whose mission is to ensure the permanent preservation of humanity’s most important information by stewarding the development of open-source software and open protocols for decentralized data storage and retrieval networks.","-68f4aae6":"We exist to advance humankind by bringing Web3 to life through education, research, and development.","2bebe058":"Where open minds, open source, and open protocols, meet.","4d2ecccb":"On today’s centralized web, a handful of corporations own the majority of the global cloud data storage market. But humanity’s most important information should never be compromised, abused, or ruled by any single entity.","74da6179":"We want the web to continue to grow and flourish and we believe that the more people, teams, organizations support a project, the more likely it is to succeed. FFDW sees Filecoin as a foundational technology for the broader decentralized web ecosystem and seeks to support that entire decentralized web community.","-61582da8":"Board of Directors","54a4374f":"Determined to bring Web3 to life, FFDW’s board brings a wealth of experience and expertise to guide our work.","26c060c6":"Marta Belcher","486f9bbd":"General Counsel, Protocol Labs","d3d0803":"Marta Belcher is the General Counsel and Head of Policy at Protocol Labs and the Board Chair of the Filecoin Foundation and the Filecoin Foundation for the Decentralized Web. She also serves as special counsel to the Electronic Frontier Foundation. Marta is a pioneer in cryptocurrency law and has spoken on the topic around the world, including in U.S. Congress, European Parliament, the New York Senate, the OECD, and in Davos during the World Economic Forum. Marta has drafted amicus briefs in the U.S. Supreme Court and U.S. appellate courts for high-profile public interest organizations, including EFF, the Center for Democracy & Technology, Public Knowledge, the Cato Institute, the National Consumers' League, Project Gutenberg, and the Blockchain Association. Marta has been recognized twice by the Financial Times Innovative Lawyer awards, was named to Law360's list of Top Attorneys Under 40, and was #18 on CryptoWeekly’s list of Most Influential Women in Crypto.","-fa026dc":"Rainey Reitman","-8e47b7c":"Board President, Freedom of the Press Foundation","3a741a7c":"Rainey Reitman's advocacy has focused on defending the rights of whistleblowers, protecting press freedom, fighting mass government surveillance, and documenting how financial exclusion has been used to silence speakers. She is a co-founder and the President of the Board of Directors of the ","-66bb9782":"Freedom of the Press Foundation","-103918c7":", a nonprofit defending the rights of journalists. She worked for the ","-3748a0de":"Electronic Frontier Foundation","-3c3de380":" (EFF) for 11 years, first as their Activism Director and then as their Chief Program Officer, and she currently serves as an advisor to EFF. Rainey also co-founded and served for six years as a steering committee member of the Chelsea Manning Support Network. She currently runs a consulting service for mission-driven organizations called ","fe4657b":"Groundwork Strategy","-350607f7":"Brian Behlendorf","-7779b3e5":"General Manager, Open Source Security Foundation","-4663b566":"Brian Behlendorf has been an advocate for open technologies and the role they can play in a more advanced and just society for nearly 30 years. He is general manager of the Open Source Security Foundation. Previously, he was executive director for Hyperledger, an initiative hosted at the Linux Foundation, and actively advising and growing other LF initiatives around supply chain traceability, public health, identity, and more. He serves on the boards of director for the Electronic Frontier Foundation (since 2013) and the Mozilla Foundation (since 2003), defending the fight for the open web and a human rights centered Internet.","-1f3ebe62":"He also chairs the technical advisory council for ID2020. Previously he has served as the Chief Technology Officer for the World Economic Forum, advised the Obama administration through the White House’s Office of Science and Technology Policy, and co-founded a series of companies in the open source software domain. Oh, and many moons ago he co-founded the Apache web server project, which he shepherded into the 501c3 Apache Software Foundation.","-230b5035":"Kristin Smith","7ef6f82d":"Executive Director, Blockchain Association","-45a92bfa":"Kristin is the Executive Director of the Blockchain Association, the Washington DC-based trade association representing the most prominent and reputable organizations in the crypto industry. The mission of the Blockchain Association is to improve the public policy environment so that blockchain networks can thrive in the United States. Kristin sets the association’s public policy strategy and leads engagement with industry and outreach to policymakers.","-4a351861":"Prior to leading the Blockchain Association, Kristin assisted blockchain and technology companies achieve their public policy objectives in Washington. She served as a Senate and congressional aide on Capitol Hill for nearly ten years, much of which was spent focusing on technology policy. She co-founded HODLpac and serves on the organization’s board of directors. Kristin is also featured on Fortune’s 2020 40 Under 40 list.","-7b057bdb":"Sheila Warren","-36ea7ffd":"Chief Executive Officer, Crypto Council for Innovation","-268b032d":"Advisors","-413ab3b5":"FFDW has assembled an outstanding group of advisors.","597be7d4":"Head of Blockchain and Data Policy, World Economic Forum","62330d7b":"Brewster Kahle","6dff2a26":"Founder, Internet Archive","40a63e":"Joe Lubin","-491e40ac":"Founder of ConsenSys, Cofounder of Ethereum","56d0b04e":"Wendy Hanamura","186e189b":"Director of Partnerships, Internet Archive","10b2bd43":"Georgia Quinn","-27dccbc7":"General Counsel, Anchorage","27937d4f":"Alex Feerst","-917dcce":"CEO, Murmuration Labs","-2578dc36":"Sandra Ro","453b09b1":"CEO, Global Blockchain Business Council","1275aa82":"Katie Biber","-448d96a6":"Filecoin Foundation for the Decentralized Web is hiring for roles as we build, support, and fund projects advancing the DWeb.","-12b421f2":"GET IN TOUCH","44beb143":"FFDW Awards","20e153":"FFDW","-61e1a33e":"Awards and Programs","-6bcfae84":"This RFP has now closed, and this page remains accessible only for reference purposes.","-7ea1c015":"Please return to ","45576d26":"ffdweb.org","-5b184db6":"The Filecoin Foundation for the Decentralized Web (FFDW) is launching a request for proposals (RFP) to identify the most compelling initiatives to partner with in three key areas:","6e3f302d":"Creator and Developer Training","2c27f684":" — We are interested in proposals for two aspects of creator and developer training. First, empower and inform the next generation of creators and developers, currently in education or in junior roles, so that they can understand, and adopt decentralized technology into their work and lives. Second, give existing Internet developers the tools they need to incorporate decentralized technology into their work. ","-75fe4241":"(Up to $1.75M per year)","-26cdad2f":"Public education","2ca316b9":" — Introduce the public to the decentralized web. These programs should inform diverse global audiences about the values, benefits, and compelling use cases of decentralized technologies. ","-3c6928fe":"(Up to $100,000 per year)","-1eb9e86e":"Universities and GLAM ","-1a270cb9":"(galleries, libraries, archives, and museums)","4a3735fb":" Institutions","-55a9f5f0":" — Drive the development and use of technologies to enable a global decentralized library for all. Projects in this area might pursue efforts such as industry-specific platforms that make uploading information to decentralized storage user-friendly and accessible. ","-7c416f7":"(Up to $800,000 per year)","-7c33898c":"If your project or initiative would be a good fit for any of these areas, submit a completed ","177a71e8":"proposal template","-6089c0c0":" by the dates listed below. Please submit your full proposal (including attachments) in Word document(s) if possible. Let us know if you have any questions! Both questions and proposals should be sent to ","-3a4f08fb":"proposals@ffdweb.org","-19b6543b":"Base Components","-39839a8c":"Logo White","-3a5a29b0":"Logo Haiti","719b5761":"Buttons","1caed350":"Primary Button","-6b1a7c62":"Secondary Button","2fedc622":"Gradient Button","-7c6cac57":"Gradient Button Red Purple","27162fc":"Animated Links","3610230d":"Text Link","1639f91f":"Scale In Link","607170b1":".scale-in-link","-5ea5b0a1":"Footer Link","-16c0bf33":"Social Link","-7e90ea1c":"Subnav Icon Link","15e596d4":"Blog Index","-6a377191":"FFDW Blog","141edda4":"Showing results for","-2d535cda":" 'query'","55217f42":"No results found that match the search query.","40be290":"First","1f7907":"Back","24ff13":"Next","2406b6":"Last","-64104400":"Contact","3f87903":"Here's where","38afe1":"you ","4a3b30":" can","-32db759b":"find us","-72bf4c4a":"We support and fund research and development, and educate people about the decentralized web, in order to preserve humanity’s most important information. Interested in joining us in this mission? Reach out.","-45128f13":"Questions? Ideas? Drop us a line ","3d7df860":"impact@ffdweb.org","-6c12fc73":"Social","4b0ff13e":"LinkedIn","4df3279d":"‍\n                ","280d3723":"YouTube","-29f21189":"Our team of thinkers and doers is growing. If you’re passionate about advancing technology forward, we want to hear from you.","33b84301":"Reach out","397ad26d":"We’re working to foster and expand the decentralized web.","3fa5c5e9":"*Required","-1d763cb7":"*Must be a valid email","3b37a9ee":"*Must be a valid phone number","-485217e5":"*Must be at least 50 characters","4c25fbf":"Share","7a0189e4":"Digest","43ab8b9":"Issue","379164d6":"Article","5dd0e116":"Current Page","-83633f5":"Accordion - Variant 1","4d13238":"Title","-76f64fc8":"Subtitle","-3c0dda4d":"What’s a Rich Text element?","2e633c6a":"The rich text element allows you to create and format headings, paragraphs, blockquotes, images, and video all in one place instead of having to add and format them individually. Just double-click and easily create content.","57fa6135":"Static and dynamic content editing","-a016b40":"A rich text element can be used with static or dynamic content. For static content, just drop it into any page and begin editing. For dynamic content, add a rich text field to any collection and then connect a rich text element to that field in the settings panel. Voila!","-4bffb26e":"How to customize formatting for each rich text","-43ba1153":"Headings, paragraphs, blockquotes, figures, images, and figure captions can all be styled after a class is added to the rich text element using the \"When inside of\" nested selector system.","-2ba903c4":"Accordion - Small","3dcd0abf":"the DWeb","-16419832":"Learn About Web3","426e936b":"We support programs that educate the public about how the internet works and what a decentralized future means for business, governments, and consumers alike","66134b8c":"The Internet has always been inherently about decentralization.","3dc9f9bc":"The first Internet protocols decentralized computing and allowed users to consume digital content. The second iteration ushered in the World Wide Web by enabling users to consume, create and share digital content together.","-13c56f2b":"After a period when a few large, centralized companies consolidated this environment into a handful of platforms, engineers and technologists are now building the next evolution of the Internet. New protocols and new applications will allow users to independently consume, create, and engage with digital content. These changes will radically transform the Internet as we now experience it, resulting in enormous potential to create a better Internet.","67d15276":"Project Partners & Collaborations","7fc4122b":"Learn about all the projects that FFDW is currently partnering and collaborating with.","-512908cc":"Some of the","-58579366":"groups we","30f69a06":"work with to","-5960f494":"grow Web3","1c6d4f20":"Boards & Advisors","65416d77":"Explore further","213ed55b":"READ THE BLOG","690e201f":"READ MORE","-7c21e355":"Past partnerships & collaborations","-22370f29":"Interactive Tutorials","36ea6735":"ProtoSchool’s self-guided interactive tutorials introduce you to DWeb concepts, protocols, and tools.","58c70452":"beginner","-18aacb0d":"Content Addressing on the Decentralized Web","6478ec0d":"Learn how hashing and content addressing enable verifiable data sharing with peers on the decentralized web.","-603be5c5":"Anatomy of a CID","-7cb7500d":"Explore the ins and outs of CIDs (Content Identifiers), the unique labels used to point to data stored on distributed information systems including IPFS, IPLD, libp2p, and…","65d126f0":"Merkle DAGs: Structuring Data for the Distributed Web","f08e01b":"Learn how we can use CIDs to create content-addressable data structures for the distributed web!","312322cb":"Blogging on the Decentralized Web","be0ac8b":"Cool content addresses don’t change. Create a chain of links from one CID to another with the IPFS DAG API.","1b1e74a4":"P2P Data Links with Content Addressing","-1093fb8a":"Store, fetch, and create verifiable links between peer-hosted datasets using the IPFS DAG API and CIDs. It’s graphs with friends!","1a45f739":"Mutable File System","1b657b89":"The Mutable File System (MFS) lets you work with files and directories as if you were using a traditional name-based file system.","2188b080":"Video Resources","2ac33ab9":"Exploring the Decentralized Web","37be95b8":"Episode 2: Return to Decentralization","-70c263fe":"Episode 1: Evolution of the Internet","-6aab7131":"Leveraging of the Dweb to Enhance Free Speech with the Latest FFDW Dev Grant","6c88abc8":"Introducing The Starling Lab","-a40a887":"Exploring the Decentralized Web - Trailer","261dcf3":"Episode 3: Data and User Control","7465d535":"Together, let's bring Web3 to life","24fff47":"Melba Roy Mouton, 1960","69a267bd":"Working with the community to advance Web3 through education, research, and development.","6bb691d9":"FFDW’s mission is to ensure the permanent preservation of humanity’s most important information by stewarding the development of open-source software and open protocols for decentralized data storage and retrieval networks. We work to build and support the decentralized web community, fund research and development, and educate the public about the decentralized web, in order to preserve humanity’s most important information.","-29d26b39":"Join our team","-e2b39e3":"If you’re passionate about decentralization, check out our open roles.","1698ddc2":"view open roles","-613962c1":"Follow us on social media","-b2bdf27":"Learn more about our hosted and sponsored events, and catch our latest announcements.","-5ae80293":"Follow Us","-5d70ca4d":"Apply for an award","-2fbb277":"FFDW currently reviews project applications quarterly. Proposals should be submitted as attachments to an email.","485cddb8":"learn more about awards","-26aca129":"Explore our educational resources","-342c0a24":"From videos to podcasts, Github repos to self-guided tutorials, we have the resources you need to dive into Web3.","58f729ac":"explore the dweb","-2eafcb1b":"Project Proposals and Awards","1b8ad0f2":"Ensuring humanity's","333b83":"most","-738c3266":"important information is never compromised,","-562faf9a":"abused, or ruled by any","-54080f2d":"single entity.","351185e3":"Meet our Awardees","1369029e":"Apply for Awards or Project Proposals","-31a1fd8f":"We’re here to build Web3 with you.","-5f006297":"FFDW collaborates with organizations that accelerate the adoption of open, decentralized technologies, help build communities that support and sustain open, decentralized technologies, and communicate to wider audiences the benefits of adopting open, decentralized technologies.","-62e2bd5b":"Projects that educate the public about how the internet works and how a decentralized web is a better web for businesses, citizens, and governments.","2ce5b6f5":"Projects that support efforts to store research data using decentralized web storage, and make that data easily shared and accessed.","-53129068":"Projects that drive the creation and development of technologies that will enable decentralized file storage of humanity’s most important information.","5838a7c4":"We’re working to build a more robust, more resilient web. A place to store and safeguard humanity’s most important information. If you’re passionate about decentralization, we want to hear from you.","-5230a9d2":"Get in touch","-b380f47":"Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nullam velit ipsum, tincidunt sit amet semper nec, fermentum et arcu. Vivamus vitae vulputate elit. Fusce lobortis eleifend commodo. Nulla sed nisl velit. Integer ante diam, tincidunt ut blandit sed, vulputate vehicula mi. Proin sit amet tincidunt enim, eu tincidunt mauris. Donec feugiat mollis pulvinar. Proin tincidunt est ultrices ante ultricies, nec malesuada nunc lacinia.","6531995a":"Filecoin Foundation and Filecoin Foundation for the Decentralized Web (collectively, \"Filecoin Foundation,\" \"we,\" \"us\") provide this Privacy Policy to explain our practices regarding the collection, use, and disclosure of your personal information both online and offline. This Privacy Policy applies to the fil.org and ffdweb.org websites (\"Websites\") and any websites, apps, or services that link to this Privacy Policy (\"Services\"), unless otherwise indicated.","-28decd6c":"Last Updated: December 31, 2022","-4f80aaba":"I. What Personal Information is Collected","-5f160662":"Depending on how you interact with us, we may collect the following categories of personal information, some of which may be considered sensitive personal information under applicable laws, when you use our Services:","31a540c1":"Information you provide directly to us.","4a5f6d71":" We may collect and store any personal information you enter on our Services or provide to us in some other manner, including personal information that may be contained in any video, comment, or other submission you upload or post to the Websites. This personal information includes:","-4b096f36":"Identifiers","-3bec52ab":", including your real name, postal address, e-mail address, telephone number, and other similar identifiers;","c3be976":"Commercial information","-7c65565c":"Geolocation data","-606e7455":", including information derived from IP address and other device information;","4568cdd1":"Demographic and profile information","-628b6dbf":", including your interests, preferences, activities, gender, age, racial or ethnic origin, and other demographic information;","469ab84f":"Audio, electronic, or visual information","381f571d":", including video, comments, or submissions uploaded to the Websites or Services; and","6931739a":"Inferences","76dd87d8":", which may be drawn from any of the categories of personal information described above.","-7762218c":"Information we may collect automatically","937e672":". We may collect internet, electronic activity, and other information from the devices and browsers that you use, including your device type; IP address; device and advertising identifiers, probabilistic identifiers, and other unique personal or online identifiers; time zone setting and location; browser type and version; browser plug in types and versions; operating system and platform; Internet service provider; pages that you visit before and after using the Services, browsing history, and search history; the date and time of your visit; information about the links you click, pages you view, and advertising you interact with within the Services and other information about how you use the Services, and the technology on the devices you use to access these Services. If you or your device experiences an error, we collect information about the error, the time the error occurred, the feature being used, the state of the application when the error occurred, and any communications or content provided at the time the error occurred.","43e8af27":"We may aggregate or de-identify the personal information described above. Aggregated or de-identified data that we do not attempt to reidentify is not subject to this Privacy Policy.","-b60bcc1":"Without this personal information, we are not able to provide you with all of the requested Services.","6e5a685b":"II. Sources of Personal Information","58e1f6dc":"In addition to receiving personal information from you, we may also periodically obtain the categories of personal information described above from other sources, including from users of our Services, operating systems and platforms, social networks, government entities that make personal information publicly available, service providers, project partners and collaborators, business partners, contractors, volunteers, and other third parties.","2129cb6c":"III. How We Use Personal Information","-37c59e79":"We may use your personal information for the following business purposes:","6e373a0a":"To provide you with access to and use of Services, including to facilitate use of our Websites, manage your account and preferences, process or fulfill orders and transactions, process payments, and provide customer service;","24325a0":"To market and advertise the Services, including emails about events and opportunities you may be interested in;","-244752aa":"To evaluate and administer funding and related applications, including to review application materials and provide funding for selected proposals;","-5fe23eb6":"To help keep the Services effective and secure, including to debug to identify and repair errors that impair existing functionality;","-58762121":"To enforce our Terms of Service;","-64153f47":"To identify and protect against fraudulent transactions and other misuses of our Services;","4672fd08":"To analyze use of and improve our Websites and Services;","-7bbfd69f":"To contact you;","-a1c972d":"To comply with applicable laws and regulatory obligations; and","7d3d7cdc":"For any other purpose disclosed to you at the time we collect your personal information with your consent.","-2bc3a399":"We do not use or disclose sensitive personal information beyond those purposes described above.","-55dc41e4":"If you post personal information about yourself or others, or communicate with others using our Services, please note that we cannot control who reads your postings or what they do with the personal information you provide. We encourage you to use caution in posting personal information.","553e1cc1":"IV. Disclosure of Personal Information","-1e4d2fd1":"We may disclose your personal information in the following circumstances:","67cefaf0":"Affiliates & Related Entities:","2441031f":" We may disclose your personal information between and among affiliates, subsidiaries, and related companies.","-4e031790":"Filecoin Foundation Working Group Participants:","-19898d9a":" We may disclose personal information, such as identifiers like real name and email, with members of working groups that Filecoin Foundation or Filecoin Foundation for the Decentralized Web participates in.","-31fff5f8":"Funding Programs:","-7ff95235":" We may disclose personal information, such as identifiers, financial information, and demographic information with entities with whom we co-administer grants or other funding programs, in order to evaluate funding applications and administer funding, including to review materials submitted and to provide the appropriate financing for selected proposals.","-3bb3596e":"Service Providers & Business Partners:","-19f21fa8":" We may disclose your personal information, including identifiers, commercial information, electronic and network activity, geolocation data, demographic information, and inferences to support a variety of business purposes. These business purposes include product and service delivery, customer service, marketing, analytics services, security and performance monitoring, maintaining and servicing accounts, processing or fulfilling orders and transactions, verifying customer information, research, verifying customer information, data hosting, auditing, and data processing.","2b33b145":"Business transactions:","f530209":" If we become involved with a merger, reorganization, corporate transaction, or another situation involving the transfer of some or all of our business assets, we may disclose your personal information with business entities or people involved in the negotiation or transfer.","-2dd3d432":"As Required by Law:","6fa0ead4":" We may also collect, use, and disclose your personal information as necessary to comply with the law, respond to subpoenas, court orders, or other legal process, law enforcement requests, legal claims or government inquiries, detect fraud, and to protect and defend the rights, interests, safety and security of our Websites, Services, users, a third-party, or the public. For instance, we may disclose your personal information if we have reason to believe doing so is necessary to identify, contact or bring legal action against someone who may be causing interference with our rights or properties, or has breached an agreement, or if anyone else could be harmed by such activities or interference, if we determine an ad posted on our Services violates our terms of use or the rights of a third party, or if there is an emergency involving danger to any person.","2412caf3":"With your consent:","-1fe08965":" We may also disclose personal information about you with other entities if you give us permission.","11aa164b":"Please note that if you post any of your personal information via the Services, such personal information may be viewed, collected, and used by others over whom we have no control. We are not responsible for the use by third parties of personal information you post or otherwise make public.","-2bf56c3d":"We do not sell personal information to third parties for monetary or other valuable consideration as defined by applicable law or share personal information for purposes of cross-contextual behavioral or targeted advertising.","4d1768e7":"V. Cookies","303c1610":"\"Cookies\" are small text files that allow websites to store and retrieve information about you from your computer system. We may serve cookies to track individual site usage for later aggregation. If you do not want information collected through the use of cookies, there is a procedure in most browser settings that allows you to automatically decline cookies, or be given the choice of declining or accepting the transfer to your computer of a particular cookie (or cookies) from a particular site. You may wish to refer to ","3b5739fd":"allaboutcookies.org/manage-cookies","523a5e81":". If you reject cookies through your browser settings, you may still use our Services, but you may experience some inconvenience.","4d47c59f":"VI. Your Rights","6d140556":"Depending on where you reside, you may be entitled to request access to, portability, correction, and deletion of your personal information.","38cb36ae":"Right to Know:","-67fa8a59":" You may have the right to know what personal information we have collected about you, including the categories of personal information, the categories of sources from which it is collected, the business or commercial purposes for collecting, selling, or sharing it, and the categories of third parties to whom we disclose it.","-6f270bee":"Right to Access & Data Portability:","-171bb4ef":" Subject to certain exceptions, you may have the right to request a copy of the personal information we collected about you.","18f0dbc2":"Right to Correction and Deletion:","32739dfe":" You may have the right to request that we correct or delete personal information that we collected from you and retain, subject to certain exceptions.","-54d1fac0":"To exercise your access, portability, correction, and deletion rights, you may submit a request by e-mail at ","-3dd52807":"privacypolicy@fil.org","-74de9daf":" or by leaving a message at (302) 440-4493. Once we receive your request, we may verify it by requesting information sufficient to confirm your identity. You may also be entitled, in accordance with applicable law, to appeal a refusal to take action on your request; to do so please respond to the email denying your request.","6ae3e3b3":"Only you, or a person authorized by you to act on your behalf, may make a verifiable consumer request related to your personal information. If you would like to use an authorized agent to exercise your rights, we may request evidence that you have provided such agent with power of attorney or that the agent otherwise has valid written authority to submit requests to exercise rights on your behalf. We reserve the right to deny requests in certain circumstances, such as where we have a reasonable belief that the request is fraudulent, where your identity cannot be confirmed, or where we must maintain your personal information consistent with applicable law.","-36bd4eea":"Note that while some of the personal information that we collect about you may be considered sensitive personal information, we process such information for only those purposes detailed in this Privacy Policy and as authorized by law. For example, we might process your sensitive personal information in order to provide the services you request from us.","-56dcd219":"VII. Other California Rights","4a124111":"Do Not Track:","4d45a067":" Our systems do not at this time have the necessary programming to honor \"Do Not Track\" or \"DNT\" browser signals. Please return to this Privacy Policy in future for further updates on this topic.","76b9fe88":"Shine the Light:","-3ab626b4":" California residents who provide certain personal information in connection with obtaining products or services for personal, family or household use are entitled to request and obtain from us once a calendar year information about the customer information we disclosed, if any, with other businesses for their own direct marketing uses. If applicable, this information would include the categories of customer information and the names and addresses of those businesses with which we disclosed customer information for the immediately prior calendar year.","-1f19425b":"VIII. Communication from Us","-4bee2fcc":"From time to time, we may send you information with announcements and updates about the Websites and the Services. You may elect to opt-out of ongoing e-mail communication from us, such as newsletters, subscriptions, and inquiries.","34ca9040":"IX. Children","-4a01069":"The Websites and Services are not intended for children under the age of 16 nor do we knowingly collect personal information from children under 16. We do not knowingly sell or share personal information of individuals under the age of 16.","7baa2d08":"X. Links to Other Sites","-4d9c225":"The Services may provide links and pointers to websites maintained by other organizations. We provide these links as a convenience to users, but we do not operate, control, or endorse such sites. We also disclaim any responsibility for the information on those sites and any products or services offered there, and cannot vouch for the privacy policies of such sites. We do not make any warranties or representations that any linked websites will function without error or interruption, or that defects will be corrected.","6de18826":"XI. E-Commerce","-3ac5a8":"We may have links to outside websites where you may engage in transactions. We are not responsible for transactions conducted on those sites and cannot vouch for the security of the personal information submitted in those transactions. We have no control over the content and security practices of outside websites.","-4e649d21":"XII. Security and Retention","61330d13":"Personal information will be retained only for so long as reasonably necessary and proportionate for the purposes set out above in accordance with applicable law and based on the criteria set out in this Privacy Policy. We have in place commercially reasonable technological and procedural security measures in an attempt to protect and safeguard the security of the personal information. Despite these efforts, please understand that no system is perfect or can guarantee that unauthorized access or theft of data might not occur.","-4889ee39":"XIII. Changes to this Privacy Policy","-4d007880":"We may amend this Privacy Policy at any time, so please review it frequently. If we make a material change to this Privacy Policy, we will update the Last Updated date on this notice.","6699aeee":"XIV. Policy Acceptance","20cc21f9":"By using the Services, you signify your acknowledgment of this Privacy Policy. If you do not agree or are not comfortable with any policy described in this Privacy Policy, you may discontinue use of the Services.","-27c72cf3":"XV. More Questions?","-287c3e9":"If you have any questions about this Privacy Policy, email them to ","-17bd96e1":" and be sure to indicate the specific site you're visiting and the nature of your question or concern.","-27ce7a1":"Welcome to the DWeb Impact Resource Hub! Explore the intersection of decentralized technologies and social good with blog posts, research papers, news, tutorials, and more from FFDW and beyond.","4d3dd0f":"Topic","667cb80c":"Resource Type","7d6db798":"Filter","1a28363b":"Filter by:","2b99750e":"Clear All","2097a2":"Done","2769be":"Sort","-4d4f0033":"Date (Newest)","-d82972c":"Date (Oldest)","26edafdd":"Title (A/Z)","26f90a1d":"Title (Z/A)","-25cfc60":"Source (A/Z)","-251a220":"Source (Z/A)","7635fb4f":"This is some text inside of a div block.","74472e60":"Tag template","1ddcf9aa":"Have something great to add to the DWeb Impact Resources? We want to know!","-3b1a420b":"Submit a Resource","-7aba473":"Style Guide","5500514f":"Typography","-3e9c0e0c":"Headline","8e9":"H1","8ea":"H2","8eb":"H3","8ec":"H4","8ed":"H5","8ee":"H6","-5286fc08":"Lorem ipsum dolor sit amet, consectetur adipiscing elit. Suspendisse varius enim in eros elementum tristique. Duis cursus, mi quis viverra ornare, eros dolor interdum nulla, ut commodo diam libero vitae erat. Aenean faucibus nibh et justo cursus id rutrum lorem imperdiet. Nunc ut sem vitae risus tristique posuere.","-4a191571":".text-style-p1","-4a19156f":".text-style-p3","-594e5856":".label-1","-594e5855":".label-2","3f3470e9":"Block Quote","4dad4a0f":"blockquote","2af10155":"List Item","2424be":"List","-13ad40b5":"H1 Headline","2d3b0ea":"H2 Headline","-36d0ed58":"H4 Headline","-58a047b7":"RichText","71edc2e3":".richtext-content","40e9c0f":"Forms","7029bb8":".form-wrapper","78a3a990":"Colors","4244ce5":"Haiti","3d247ab":".bg-haiti","-6f7f9cab":"#070517","-7bc4202c":"Cararra","5056411a":".bg-cararra","-4b922a6c":"#E8E7E1","71860e2":"Electric Violet","-681e6f13":"#4A22FC","3ac29524":"Perfume","6dcf66a":".bg-perfume","-50dc5f3c":"#B5B5FA","2d3fe471":"Green Yellow","-3ac68ae8":".bg-green-yellow","-503139fc":"#BAFE36","1299afe2":"Coral Red","41a7389b":".bg-coral-red","-495893c9":"#FB383F","-6c05e3b3":"Spaces","5ef36c61":"Container","-334c5fed":".container","1e65a024":"Container/ No Padding","3cfa0c0":".container.no-padding","-c4550f2":"Container Full","5c065e02":".container--full","6aca4aa0":"Container Full / Maxed","7c12a17":".container--full.maxed","1d190f23":"Gradients","-1e581ee1":"Purple Green","4240664e":".gradient:purple-green","1ec887b9":"Green Purple","7e6cea6b":"Red Purple","2ef2d414":".gradient:red-purple","3f24722d":"Purple Red","964a69c":".gradient:purple-red","5e6a5a74":"Red Green","641c17ab":".gradient:red-green","-d727e4c":"Green Red","-1fac5055":".gradient:green-red","4f912d2b":"Terms & Conditions","-daf3bd0":"Effective Date: December 1, 2021 These Terms of Use (“Terms”) govern your use of Filecoin Foundation for the Decentralized Web website and any other website that FFDW operates and that links to these Terms (collectively, the “Website”).","31bca865":"Please review these Terms carefully before using the Website. We may change these Terms or modify any features of the Website at any time. The most current version of the Terms can be viewed by clicking on the “Terms of Use” link posted through the Website. You accept the Terms by using the Website, and you accept any changes to the Terms by continuing to use the Website after we post the changes.","-662374b3":"I. Privacy","6c5bb5b9":"By using the Website, you consent to our processing your information consistent with our Privacy Policy.","44deb20":"You may not access or use, or attempt to access or use, the Website to take any action that could harm us or any third party, interfere with the operation of the Website, or use the Website in a manner that violates any laws. For example, and without limitation, you may not:","102f79f3":"Engage in unauthorized spidering, “scraping,” or harvesting of content or personal information, or use any other unauthorized automated means to compile information;","72dc078d":"Take any action that imposes an unreasonable or disproportionately large load on our network or infrastructure;","26b5446b":"Use any device, software, or routine to interfere or attempt to interfere with the proper working of the Website or any activity conducted on the Website or attempt to probe, scan, test the vulnerability of, or breach the security of any system or network;","-8e84456":"Attempt to decipher, decompile, disassemble, or reverse-engineer any of the software comprising or in any way making up a part of the Website;","-603f1281":"Engage in any other conduct that restricts or inhibits any person from using or enjoying the Website, or that, in our sole judgment, exposes us or any of our users, affiliates, or any other third party to any liability, damages, or detriment of any type.","14bdbb30":"Violations of system or network security may result in civil or criminal liability. We may investigate and work with law enforcement authorities to prosecute users who violate these Terms. We may suspend or terminate your access to the Website for any or no reason at any time without notice.","78ae285a":"III. Intellectual Property","-6a5a9e48":"The Website is owned and operated by Filecoin Foundation for the Decentralized Web. You acknowledge and agree that, as between the parties, we own all right, title and interest in and to the Website, including: (a) all information, data, software, text, displays and visual interfaces, graphics, images, video, and audio, and all other elements of the Website, and the design, selection, and arrangement thereof; and (b) all intellectual property and other legal rights (including, but not limited to, any and all copyrights, patents, patent applications, trade secrets, trademarks and other intangible rights) therein. You may not publish, reproduce, distribute, display, perform, edit, adapt, modify, or otherwise exploit any part of the Website without our written consent. You will not earn or acquire any ownership rights in any copyrights, patents, trade secrets, trademarks or other intellectual property rights on account of these Terms or any access to or use of the Website.","-28cdd6a6":"IV. Links to Third-Party Content","5f1b1d78":"The Website may contain links to third-party content. We do not control, endorse, sponsor, recommend, or otherwise accept responsibility for such content. Use of any linked third-party content is at your own risk.","-3943280":"V. Communications With You","-28ea35b5":"If you provide your email address or other contact information to us, we may communicate with you about the Website and our products and services, including through one or more third party e-mail or survey services, via the contact information you provide to us through the Website. You consent to receive communications from us that may: (i) solicit feedback via e-mail, surveys, bug reports, or other methods we may determine; (ii) collect additional information regarding issues you report in your feedback; (iii) notify you of changes to the Website, our products or services, or these Terms; and (iv) tell you about our programs, products or services.","-6d2f2ead":"VI. Disclaimer of Warranties; Limitations of Liability","1f17b613":"YOUR USE OF THE WEBSITE IS AT YOUR OWN RISK. THE WEBSITE IS PROVIDED “AS IS” WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT, OR OTHER VIOLATION OF RIGHTS. WE DO NOT WARRANT THE ADEQUACY, CURRENCY, ACCURACY, LIKELY RESULTS, OR COMPLETENESS OF THE WEBSITE OR ANY THIRD-PARTY SITES LINKED TO OR FROM THE WEBSITE, OR THAT THE FUNCTIONS PROVIDED WILL BE UNINTERRUPTED, VIRUS, OR ERROR-FREE. WE EXPRESSLY DISCLAIM ANY LIABILITY FOR ANY ERRORS OR OMISSIONS IN THE CONTENT INCLUDED IN THE WEBSITE OR ANY THIRD-PARTY SITES LINKED TO OR FROM THE WEBSITE. SOME JURISDICTIONS MAY NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES, SO SOME OF THE ABOVE EXCLUSIONS MAY NOT APPLY TO YOU.","fa6d76e":"IN NO EVENT WILL WE, OR OUR AFFILIATES, DIRECTORS, OFFICERS, EMPLOYEES, AGENTS, OR ASSIGNS BE LIABLE FOR ANY DIRECT OR INDIRECT, SPECIAL, INCIDENTAL, CONSEQUENTIAL OR PUNITIVE DAMAGES, LOST PROFITS, OR OTHER DAMAGES WHATSOEVER ARISING IN CONNECTION WITH THE USE OF THE WEBSITE, ANY INTERRUPTION IN AVAILABILITY OF THE WEBSITE, DELAY IN OPERATION OR TRANSMISSION, COMPUTER VIRUS, LOSS OF DATA, OR USE, MISUSE, RELIANCE, REVIEW, MANIPULATION, OR OTHER UTILIZATION IN ANY MANNER WHATSOEVER OF THE WEBSITE OR THE DATA COLLECTED THROUGH THE WEBSITE, EVEN IF ONE OR MORE OF THEM HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES OR LOSS. ANY CLAIM ARISING OUT OF OR CONNECTED WITH THE WEBSITE WILL BE LIMITED TO THE GREATER OF $100 OR THE AMOUNT THAT YOU PAID TO ACCESS THE WEBSITE.","250e0fbf":"VII. Indemification","-ebe819b":"YOU AGREE TO INDEMNIFY, DEFEND AND HOLD US AND OUR AFFILIATES, DIRECTORS, OFFICERS, EMPLOYEES, AGENTS AND ASSIGNS HARMLESS FROM AND AGAINST ANY AND ALL LOSSES, COSTS, EXPENSES (INCLUDING REASONABLE ATTORNEYS’ FEES AND EXPENSES), CLAIMS, DAMAGES AND LIABILITIES RELATED TO OR ASSOCIATED WITH YOUR USE OF THE WEBSITE AND ANY ALLEGED VIOLATION BY YOU OF THESE TERMS. WE RESERVE THE RIGHT TO ASSUME THE EXCLUSIVE DEFENSE OF ANY CLAIM FOR WHICH WE ARE ENTITLED TO INDEMNIFICATION UNDER THIS SECTION. IN SUCH EVENT, YOU SHALL PROVIDE US WITH SUCH COOPERATION AS WE REASONABLY REQUEST.","6677d8ab":"VIII. Choice of Law and Forum","-36092a41":"You agree that your access to and use of the Website will be governed by and will be construed in accordance with the law of the State of California without regard to principles of conflicts of laws. You agree that any claim or dispute against us arising out of or relating to the Website must be resolved by a federal district court located in California, unless agreed upon by all parties.","7b07324d":"IX. Miscellaneous","6ed38e0a":"These Terms constitute the entire agreement between you and us, superseding any prior or contemporaneous communications and proposals (whether oral, written or electronic) between you and us, regarding the subject matter hereof. In the event that any provision of these Terms is held unenforceable, it will not affect the validity or enforceability of the remaining provisions and will be replaced by an enforceable provision that comes closest to the intention underlying the unenforceable provision. You agree that no joint venture, partnership, employment, or agency relationship exists between you and us as a result of these Terms or your access to and use of the Website.","-6714307e":"Our failure to enforce any provisions of these Terms or respond to a violation by any party does not waive our right to subsequently enforce any terms or conditions of the Terms or respond to any violations. Nothing contained in these Terms is in derogation of our right to comply with governmental, court, and law enforcement requests or requirements relating to your use of the Website or information provided to or gathered by us with respect to such use."}